Revit 2027 API
ParameterTypeId.AutoJoinCondition Property
 "Join Condition"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AutoJoinCondition { get; }
Public Shared ReadOnly Property AutoJoinCondition As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AutoJoinCondition {
	ForgeTypeId^ get ();
}
static member AutoJoinCondition : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace